; domain
(define (domain rover)
(:requirements :strips :typing)
(:types rover waypoint store camera mode lander objective)

(:predicates (at ?x - rover ?y - waypoint)
             (at_lander ?x - lander ?y - waypoint)
             (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	     (equipped_for_soil_analysis ?r - rover)
             (equipped_for_rock_analysis ?r - rover)
             (equipped_for_imaging ?r - rover)
             (empty ?s - store)
             (have_rock_analysis ?r - rover ?w - waypoint)
             (have_soil_analysis ?r - rover ?w - waypoint)
             (full ?s - store)
	     (calibrated ?c - camera ?r - rover)
	     (supports ?c - camera ?m - mode)
             (available ?r - rover)
             (visible ?w - waypoint ?p - waypoint)
             (have_image ?r - rover ?o - objective ?m - mode)
             (communicated_soil_data ?w - waypoint)
             (communicated_rock_data ?w - waypoint)
             (communicated_image_data ?o - objective ?m - mode)
	     (at_soil_sample ?w - waypoint)
	     (at_rock_sample ?w - waypoint)
             (visible_from ?o - objective ?w - waypoint)
	     (store_of ?s - store ?r - rover)
	     (calibration_target ?i - camera ?o - objective)
	     (on_board ?i - camera ?r - rover)
	     (channel_free ?l - lander))


(:action navigate
:parameters (?param_1 - rover ?param_2 - waypoint ?param_3 - waypoint)
:precondition (and
		(at ?param_1 ?param_2)
)
:effect (and (at ?param_1 ?param_3) (not (at ?param_1 ?param_2))))

(:action sample_soil
:parameters (?param_1 - rover ?param_2 - store ?param_3 - waypoint)
:precondition (and
		(at ?param_1 ?param_3) (at_soil_sample ?param_3) (empty ?param_2) (equipped_for_soil_analysis ?param_1) (store_of ?param_2 ?param_1)
)
:effect (and (full ?param_2) (have_soil_analysis ?param_1 ?param_3) (not (empty ?param_2)) (not (at_soil_sample ?param_3))))

(:action sample_rock
:parameters (?param_1 - rover ?param_2 - store ?param_3 - waypoint)
:precondition (and
		(at ?param_1 ?param_3) (at_rock_sample ?param_3) (empty ?param_2) (equipped_for_rock_analysis ?param_1) (store_of ?param_2 ?param_1)
)
:effect (and (have_rock_analysis ?param_1 ?param_3) (full ?param_2) (not (empty ?param_2)) (not (at_rock_sample ?param_3))))

(:action drop
:parameters (?param_1 - rover ?param_2 - store)
:precondition (and
		(full ?param_2) (store_of ?param_2 ?param_1)
)
:effect (and (empty ?param_2) (not (full ?param_2))))

(:action calibrate 
:parameters (?param_1 - rover ?param_2 - camera ?param_3 - objective ?param_4 - waypoint) 
:precondition (and
		(at ?param_1 ?param_4) (calibration_target ?param_2 ?param_3) (on_board ?param_2 ?param_1) (visible_from ?param_3 ?param_4)
)
:effect (and (calibrated ?param_2 ?param_1) ))

(:action take_image 
:parameters (?param_1 - rover ?param_2 - waypoint ?param_3 - objective ?param_4 - camera ?param_5 - mode) 
:precondition (and
		(at ?param_1 ?param_2) (calibrated ?param_4 ?param_1) (supports ?param_4 ?param_5) (visible_from ?param_3 ?param_2)
)
:effect (and (have_image ?param_1 ?param_3 ?param_5) (not (calibrated ?param_4 ?param_1))))

(:action communicate_soil_data 
:parameters (?param_1 - rover ?param_2 - lander ?param_3 - waypoint ?param_4 - waypoint ?param_5 - waypoint) 
:precondition (and
		(at ?param_1 ?param_4) (at_lander ?param_2 ?param_5) (have_soil_analysis ?param_1 ?param_3)
)
:effect (and (communicated_soil_data ?param_3) ))

(:action communicate_rock_data 
:parameters (?param_1 - rover ?param_2 - lander ?param_3 - waypoint ?param_4 - waypoint ?param_5 - waypoint) 
:precondition (and
		(at ?param_1 ?param_4) (at_lander ?param_2 ?param_5) (have_rock_analysis ?param_1 ?param_3)
)
:effect (and (communicated_rock_data ?param_3) ))

(:action communicate_image_data 
:parameters (?param_1 - rover ?param_2 - lander ?param_3 - objective ?param_4 - mode ?param_5 - waypoint ?param_6 - waypoint) 
:precondition (and
		(at ?param_1 ?param_5) (at_lander ?param_2 ?param_6) (have_image ?param_1 ?param_3 ?param_4)
)
:effect (and (communicated_image_data ?param_3 ?param_4) ))
)

; problem
(define (problem rover-85)
 (:domain rover)
 (:objects 
    general - lander
    colour high_res low_res - mode
    rover1 rover2 rover3 rover4 - rover
    rover1store rover2store rover3store rover4store - store
    waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 waypoint9 - waypoint
    camera1 camera2 camera3 camera4 - camera
    objective1 objective2 objective3 objective4 objective5 objective6 objective7 objective8 objective9 - objective)
 (:init 
    (at_lander general waypoint9)
    (at rover1 waypoint4)
    (at rover2 waypoint4)
    (at rover3 waypoint8)
    (at rover4 waypoint2)
    (equipped_for_soil_analysis rover2)
    (equipped_for_soil_analysis rover4)
    (equipped_for_soil_analysis rover1)
    (equipped_for_rock_analysis rover3)
    (equipped_for_imaging rover1)
    (equipped_for_imaging rover3)
    (equipped_for_imaging rover2)
    (empty rover1store)
    (empty rover2store)
    (empty rover3store)
    (empty rover4store)
    (store_of rover1store rover1)
    (store_of rover2store rover2)
    (store_of rover3store rover3)
    (store_of rover4store rover4)
    (at_rock_sample waypoint3)
    (at_rock_sample waypoint4)
    (at_rock_sample waypoint5)
    (at_rock_sample waypoint7)
    (at_rock_sample waypoint8)
    (at_rock_sample waypoint9)
    (at_soil_sample waypoint1)
    (at_soil_sample waypoint2)
    (at_soil_sample waypoint9)
    (visible waypoint3 waypoint8)
    (visible waypoint3 waypoint4)
    (visible waypoint2 waypoint7)
    (visible waypoint4 waypoint3)
    (visible waypoint8 waypoint7)
    (visible waypoint6 waypoint1)
    (visible waypoint6 waypoint8)
    (visible waypoint9 waypoint2)
    (visible waypoint5 waypoint7)
    (visible waypoint2 waypoint9)
    (visible waypoint8 waypoint3)
    (visible waypoint7 waypoint2)
    (visible waypoint8 waypoint6)
    (visible waypoint1 waypoint6)
    (visible waypoint7 waypoint5)
    (visible waypoint7 waypoint8)
    (visible waypoint5 waypoint8)
    (visible waypoint8 waypoint5)
    (visible waypoint1 waypoint9)
    (visible waypoint9 waypoint1)
    (visible waypoint1 waypoint5)
    (visible waypoint5 waypoint1)
    (visible waypoint5 waypoint9)
    (visible waypoint9 waypoint5)
    (visible waypoint2 waypoint5)
    (visible waypoint5 waypoint2)
    (visible waypoint3 waypoint9)
    (visible waypoint9 waypoint3)
    (visible waypoint3 waypoint7)
    (visible waypoint7 waypoint3)
    (visible waypoint1 waypoint2)
    (visible waypoint2 waypoint1)
    (can_traverse rover1 waypoint3 waypoint8)
    (can_traverse rover1 waypoint3 waypoint4)
    (can_traverse rover1 waypoint2 waypoint7)
    (can_traverse rover1 waypoint4 waypoint3)
    (can_traverse rover1 waypoint8 waypoint7)
    (can_traverse rover1 waypoint6 waypoint1)
    (can_traverse rover1 waypoint6 waypoint8)
    (can_traverse rover1 waypoint9 waypoint2)
    (can_traverse rover1 waypoint5 waypoint7)
    (can_traverse rover1 waypoint2 waypoint9)
    (can_traverse rover1 waypoint8 waypoint3)
    (can_traverse rover1 waypoint7 waypoint2)
    (can_traverse rover1 waypoint8 waypoint6)
    (can_traverse rover1 waypoint1 waypoint6)
    (can_traverse rover1 waypoint7 waypoint5)
    (can_traverse rover1 waypoint7 waypoint8)
    (can_traverse rover1 waypoint1 waypoint9)
    (can_traverse rover1 waypoint9 waypoint1)
    (can_traverse rover1 waypoint5 waypoint9)
    (can_traverse rover1 waypoint9 waypoint5)
    (can_traverse rover1 waypoint3 waypoint9)
    (can_traverse rover1 waypoint9 waypoint3)
    (can_traverse rover1 waypoint1 waypoint2)
    (can_traverse rover1 waypoint2 waypoint1)
    (can_traverse rover2 waypoint3 waypoint8)
    (can_traverse rover2 waypoint3 waypoint4)
    (can_traverse rover2 waypoint2 waypoint7)
    (can_traverse rover2 waypoint4 waypoint3)
    (can_traverse rover2 waypoint8 waypoint7)
    (can_traverse rover2 waypoint6 waypoint1)
    (can_traverse rover2 waypoint6 waypoint8)
    (can_traverse rover2 waypoint9 waypoint2)
    (can_traverse rover2 waypoint5 waypoint7)
    (can_traverse rover2 waypoint2 waypoint9)
    (can_traverse rover2 waypoint8 waypoint3)
    (can_traverse rover2 waypoint7 waypoint2)
    (can_traverse rover2 waypoint8 waypoint6)
    (can_traverse rover2 waypoint1 waypoint6)
    (can_traverse rover2 waypoint7 waypoint5)
    (can_traverse rover2 waypoint7 waypoint8)
    (can_traverse rover2 waypoint5 waypoint8)
    (can_traverse rover2 waypoint8 waypoint5)
    (can_traverse rover2 waypoint5 waypoint9)
    (can_traverse rover2 waypoint9 waypoint5)
    (can_traverse rover3 waypoint3 waypoint8)
    (can_traverse rover3 waypoint3 waypoint4)
    (can_traverse rover3 waypoint2 waypoint7)
    (can_traverse rover3 waypoint4 waypoint3)
    (can_traverse rover3 waypoint8 waypoint7)
    (can_traverse rover3 waypoint6 waypoint1)
    (can_traverse rover3 waypoint6 waypoint8)
    (can_traverse rover3 waypoint9 waypoint2)
    (can_traverse rover3 waypoint5 waypoint7)
    (can_traverse rover3 waypoint2 waypoint9)
    (can_traverse rover3 waypoint8 waypoint3)
    (can_traverse rover3 waypoint7 waypoint2)
    (can_traverse rover3 waypoint8 waypoint6)
    (can_traverse rover3 waypoint1 waypoint6)
    (can_traverse rover3 waypoint7 waypoint5)
    (can_traverse rover3 waypoint7 waypoint8)
    (can_traverse rover3 waypoint1 waypoint2)
    (can_traverse rover3 waypoint2 waypoint1)
    (can_traverse rover4 waypoint3 waypoint8)
    (can_traverse rover4 waypoint3 waypoint4)
    (can_traverse rover4 waypoint2 waypoint7)
    (can_traverse rover4 waypoint4 waypoint3)
    (can_traverse rover4 waypoint8 waypoint7)
    (can_traverse rover4 waypoint6 waypoint1)
    (can_traverse rover4 waypoint6 waypoint8)
    (can_traverse rover4 waypoint9 waypoint2)
    (can_traverse rover4 waypoint5 waypoint7)
    (can_traverse rover4 waypoint2 waypoint9)
    (can_traverse rover4 waypoint8 waypoint3)
    (can_traverse rover4 waypoint7 waypoint2)
    (can_traverse rover4 waypoint8 waypoint6)
    (can_traverse rover4 waypoint1 waypoint6)
    (can_traverse rover4 waypoint7 waypoint5)
    (can_traverse rover4 waypoint7 waypoint8)
    (can_traverse rover4 waypoint1 waypoint9)
    (can_traverse rover4 waypoint9 waypoint1)
    (can_traverse rover4 waypoint5 waypoint9)
    (can_traverse rover4 waypoint9 waypoint5)
    (can_traverse rover4 waypoint3 waypoint9)
    (can_traverse rover4 waypoint9 waypoint3)
    (can_traverse rover4 waypoint1 waypoint2)
    (can_traverse rover4 waypoint2 waypoint1)
    (calibration_target camera1 objective6)
    (on_board camera1 rover3)
    (supports camera1 colour)
    (supports camera1 high_res)
    (supports camera1 low_res)
    (calibration_target camera2 objective1)
    (on_board camera2 rover3)
    (supports camera2 colour)
    (calibration_target camera3 objective6)
    (on_board camera3 rover2)
    (supports camera3 high_res)
    (supports camera3 low_res)
    (supports camera3 colour)
    (calibration_target camera4 objective5)
    (on_board camera4 rover1)
    (supports camera4 colour)
    (supports camera4 low_res)
    (visible_from objective1 waypoint7)
    (visible_from objective1 waypoint9)
    (visible_from objective1 waypoint4)
    (visible_from objective2 waypoint3)
    (visible_from objective2 waypoint6)
    (visible_from objective2 waypoint4)
    (visible_from objective2 waypoint5)
    (visible_from objective3 waypoint4)
    (visible_from objective3 waypoint1)
    (visible_from objective3 waypoint9)
    (visible_from objective3 waypoint8)
    (visible_from objective3 waypoint3)
    (visible_from objective3 waypoint5)
    (visible_from objective3 waypoint7)
    (visible_from objective4 waypoint4)
    (visible_from objective4 waypoint1)
    (visible_from objective4 waypoint7)
    (visible_from objective4 waypoint5)
    (visible_from objective4 waypoint9)
    (visible_from objective5 waypoint9)
    (visible_from objective5 waypoint7)
    (visible_from objective5 waypoint2)
    (visible_from objective5 waypoint5)
    (visible_from objective5 waypoint4)
    (visible_from objective6 waypoint3)
    (visible_from objective6 waypoint1)
    (visible_from objective6 waypoint6)
    (visible_from objective6 waypoint5)
    (visible_from objective6 waypoint9)
    (visible_from objective6 waypoint8)
    (visible_from objective6 waypoint7)
    (visible_from objective6 waypoint4)
    (visible_from objective6 waypoint2)
    (visible_from objective7 waypoint8)
    (visible_from objective7 waypoint5)
    (visible_from objective7 waypoint6)
    (visible_from objective7 waypoint4)
    (visible_from objective8 waypoint6)
    (visible_from objective8 waypoint5)
    (visible_from objective8 waypoint7)
    (visible_from objective8 waypoint3)
    (visible_from objective8 waypoint4)
    (visible_from objective8 waypoint9)
    (visible_from objective8 waypoint2)
    (visible_from objective9 waypoint7))
 (:goal (and 
(communicated_rock_data waypoint5)
(communicated_rock_data waypoint4)
(communicated_rock_data waypoint7)
(communicated_rock_data waypoint8)
(communicated_rock_data waypoint3)
(communicated_image_data objective6 colour)
(communicated_image_data objective5 low_res)
(communicated_image_data objective4 high_res)
(communicated_image_data objective2 low_res)
(communicated_image_data objective9 colour)
(communicated_image_data objective9 low_res)
(communicated_image_data objective3 high_res)
(communicated_image_data objective2 colour)
))
)

; plan
1. (calibrate rover3 camera1 objective6 waypoint8)
   added: (calibrated camera1 rover3)
   goals met: 0 of 13
2. (sample_rock rover3 rover3store waypoint8)
   deleted: (empty rover3store) (at_rock_sample waypoint8)
   added: (have_rock_analysis rover3 waypoint8) (full rover3store)
   goals met: 0 of 13
3. (navigate rover3 waypoint8 waypoint3)
   deleted: (at rover3 waypoint8)
   added: (at rover3 waypoint3)
   goals met: 0 of 13
4. (communicate_rock_data rover3 general waypoint8 waypoint3 waypoint9)
   added: (communicated_rock_data waypoint8)
   goals met: 1 of 13
5. (navigate rover3 waypoint3 waypoint4)
   deleted: (at rover3 waypoint3)
   added: (at rover3 waypoint4)
   goals met: 1 of 13
6. (drop rover3 rover3store)
   deleted: (full rover3store)
   added: (empty rover3store)
   goals met: 1 of 13
7. (sample_rock rover3 rover3store waypoint4)
   deleted: (empty rover3store) (at_rock_sample waypoint4)
   added: (have_rock_analysis rover3 waypoint4) (full rover3store)
   goals met: 1 of 13
8. (navigate rover3 waypoint4 waypoint3)
   deleted: (at rover3 waypoint4)
   added: (at rover3 waypoint3)
   goals met: 1 of 13
9. (communicate_rock_data rover3 general waypoint4 waypoint3 waypoint9)
   added: (communicated_rock_data waypoint4)
   goals met: 2 of 13
10. (drop rover3 rover3store)
   deleted: (full rover3store)
   added: (empty rover3store)
   goals met: 2 of 13
11. (sample_rock rover3 rover3store waypoint3)
   deleted: (empty rover3store) (at_rock_sample waypoint3)
   added: (have_rock_analysis rover3 waypoint3) (full rover3store)
   goals met: 2 of 13
12. (communicate_rock_data rover3 general waypoint3 waypoint3 waypoint9)
   added: (communicated_rock_data waypoint3)
   goals met: 3 of 13
13. (navigate rover3 waypoint3 waypoint8)
   deleted: (at rover3 waypoint3)
   added: (at rover3 waypoint8)
   goals met: 3 of 13
14. (navigate rover3 waypoint8 waypoint7)
   deleted: (at rover3 waypoint8)
   added: (at rover3 waypoint7)
   goals met: 3 of 13
15. (drop rover3 rover3store)
   deleted: (full rover3store)
   added: (empty rover3store)
   goals met: 3 of 13
16. (calibrate rover3 camera2 objective1 waypoint7)
   added: (calibrated camera2 rover3)
   goals met: 3 of 13
17. (take_image rover3 waypoint7 objective9 camera2 colour)
   deleted: (calibrated camera2 rover3)
   added: (have_image rover3 objective9 colour)
   goals met: 3 of 13
18. (take_image rover3 waypoint7 objective9 camera1 low_res)
   deleted: (calibrated camera1 rover3)
   added: (have_image rover3 objective9 low_res)
   goals met: 3 of 13
19. (calibrate rover3 camera1 objective6 waypoint7)
   added: (calibrated camera1 rover3)
   goals met: 3 of 13
20. (sample_rock rover3 rover3store waypoint7)
   deleted: (empty rover3store) (at_rock_sample waypoint7)
   added: (have_rock_analysis rover3 waypoint7) (full rover3store)
   goals met: 3 of 13
21. (navigate rover3 waypoint7 waypoint5)
   deleted: (at rover3 waypoint7)
   added: (at rover3 waypoint5)
   goals met: 3 of 13
22. (communicate_image_data rover3 general objective9 low_res waypoint5 waypoint9)
   added: (communicated_image_data objective9 low_res)
   goals met: 4 of 13
23. (communicate_image_data rover3 general objective9 colour waypoint5 waypoint9)
   added: (communicated_image_data objective9 colour)
   goals met: 5 of 13
24. (communicate_rock_data rover3 general waypoint7 waypoint5 waypoint9)
   added: (communicated_rock_data waypoint7)
   goals met: 6 of 13
25. (drop rover3 rover3store)
   deleted: (full rover3store)
   added: (empty rover3store)
   goals met: 6 of 13
26. (sample_rock rover3 rover3store waypoint5)
   deleted: (empty rover3store) (at_rock_sample waypoint5)
   added: (have_rock_analysis rover3 waypoint5) (full rover3store)
   goals met: 6 of 13
27. (communicate_rock_data rover3 general waypoint5 waypoint5 waypoint9)
   added: (communicated_rock_data waypoint5)
   goals met: 7 of 13
28. (take_image rover3 waypoint5 objective3 camera1 high_res)
   deleted: (calibrated camera1 rover3)
   added: (have_image rover3 objective3 high_res)
   goals met: 7 of 13
29. (calibrate rover3 camera1 objective6 waypoint5)
   added: (calibrated camera1 rover3)
   goals met: 7 of 13
30. (take_image rover3 waypoint5 objective4 camera1 high_res)
   deleted: (calibrated camera1 rover3)
   added: (have_image rover3 objective4 high_res)
   goals met: 7 of 13
31. (communicate_image_data rover3 general objective4 high_res waypoint5 waypoint9)
   added: (communicated_image_data objective4 high_res)
   goals met: 8 of 13
32. (communicate_image_data rover3 general objective3 high_res waypoint5 waypoint9)
   added: (communicated_image_data objective3 high_res)
   goals met: 9 of 13
33. (calibrate rover3 camera1 objective6 waypoint5)
   added: (calibrated camera1 rover3)
   goals met: 9 of 13
34. (take_image rover3 waypoint5 objective2 camera1 colour)
   deleted: (calibrated camera1 rover3)
   added: (have_image rover3 objective2 colour)
   goals met: 9 of 13
35. (communicate_image_data rover3 general objective2 colour waypoint5 waypoint9)
   added: (communicated_image_data objective2 colour)
   goals met: 10 of 13
36. (calibrate rover3 camera1 objective6 waypoint5)
   added: (calibrated camera1 rover3)
   goals met: 10 of 13
37. (take_image rover3 waypoint5 objective2 camera1 low_res)
   deleted: (calibrated camera1 rover3)
   added: (have_image rover3 objective2 low_res)
   goals met: 10 of 13
38. (communicate_image_data rover3 general objective2 low_res waypoint5 waypoint9)
   added: (communicated_image_data objective2 low_res)
   goals met: 11 of 13
39. (calibrate rover3 camera1 objective6 waypoint5)
   added: (calibrated camera1 rover3)
   goals met: 11 of 13
40. (take_image rover3 waypoint5 objective5 camera1 low_res)
   deleted: (calibrated camera1 rover3)
   added: (have_image rover3 objective5 low_res)
   goals met: 11 of 13
41. (communicate_image_data rover3 general objective5 low_res waypoint5 waypoint9)
   added: (communicated_image_data objective5 low_res)
   goals met: 12 of 13
42. (calibrate rover3 camera1 objective6 waypoint5)
   added: (calibrated camera1 rover3)
   goals met: 12 of 13
43. (take_image rover3 waypoint5 objective6 camera1 colour)
   deleted: (calibrated camera1 rover3)
   added: (have_image rover3 objective6 colour)
   goals met: 12 of 13
44. (communicate_image_data rover3 general objective6 colour waypoint5 waypoint9)
   added: (communicated_image_data objective6 colour)
   goals met: 13 of 13
